<template>
    <GeContainer class="homepage__container">
        <GeHeader class="homepage__header__wrap">
            <div class="homepage__header">
                <div style="display: flex; align-items: center">
                    <img
                        style="width: 36px; height: 36px"
                        src="https://st0.dancf.com/static/02/202105211033-926a.png"
                    />
                    <div class="header__title">GD-EUI</div>
                </div>
                <div class="homepage__header__right">
                    <a class="homepage__header__right__a" @click="goDocs">
                        <div class="homepage__header__right__bt">
                            <svg
                                t="1644491070532"
                                class="icon"
                                viewBox="0 0 1024 1024"
                                version="1.1"
                                xmlns="http://www.w3.org/2000/svg"
                                p-id="2973"
                                width="20"
                                height="20"
                            >
                                <path
                                    d="M507.448889 441.457778c-36.408889 0-68.266667 29.582222-68.266667 68.266666 0 36.408889 29.582222 68.266667 68.266667 68.266667s68.266667-29.582222 68.266667-68.266667c0-36.408889-29.582222-68.266667-68.266667-68.266666z"
                                    fill="#2254f4"
                                    p-id="2974"
                                ></path>
                                <path
                                    d="M507.448889 63.715556c-245.76 0-446.008889 200.248889-446.008889 446.008888S261.688889 955.733333 507.448889 955.733333s446.008889-200.248889 446.008889-446.008889C955.733333 263.964444 755.484444 63.715556 507.448889 63.715556z m202.524444 266.24l-91.022222 277.617777c-2.275556 6.826667-9.102222 13.653333-15.928889 15.928889l-277.617778 91.022222c-6.826667 2.275556-15.928889 2.275556-18.204444-2.275555-4.551111-4.551111-6.826667-11.377778-2.275556-18.204445l91.022223-277.617777c2.275556-6.826667 9.102222-13.653333 15.928889-15.928889l277.617777-91.022222c6.826667-2.275556 15.928889-2.275556 18.204445 2.275555 4.551111 4.551111 6.826667 11.377778 2.275555 18.204445z"
                                    fill="#2254f4"
                                    p-id="2975"
                                ></path>
                            </svg>
                        </div>
                    </a>
                    <a class="homepage__header__right__a" @click="goGithub">
                        <div class="homepage__header__right__bt">
                            <svg
                                t="1644493627967"
                                class="icon"
                                viewBox="0 0 1024 1024"
                                version="1.1"
                                xmlns="http://www.w3.org/2000/svg"
                                p-id="5454"
                                width="20"
                                height="20"
                            >
                                <path
                                    d="M1023.560892 524.587752c0 114.331752-32.549236 217.148443-97.647709 308.450075-65.047295 91.301632-149.132822 154.455339-252.205404 189.512299-11.975662 2.303012-20.778286 0.716493-26.305515-4.759558a27.584966 27.584966 0 0 1-8.342021-20.471218V853.150798c0-44.166653-11.566238-76.511177-34.647536-96.982394a446.272549 446.272549 0 0 0 68.32269-12.282731c20.16415-5.476051 41.044792-14.329852 62.590748-26.612583a187.311643 187.311643 0 0 0 53.992837-45.446104c14.432209-18.014672 26.203159-41.914819 35.312851-71.751618 9.109692-29.8368 13.664538-64.074912 13.664538-102.765514 0-55.118754-17.554069-102.049021-52.61103-140.739623 16.376974-41.454216 14.636921-87.872703-5.373695-139.357815-12.436265-4.094244-30.399759-1.535341-53.941659 7.523172a355.17563 355.17563 0 0 0-61.311297 30.041513l-25.333132 16.376974a462.137743 462.137743 0 0 0-127.945112-17.707604 462.137743 462.137743 0 0 0-127.945111 17.758782 589.571074 589.571074 0 0 0-28.301459-18.424096c-11.77095-7.31846-30.34858-16.069906-55.681713-26.305515-25.281954-10.235609-44.422543-13.306292-57.31941-9.212048-19.498835 51.433935-21.085354 97.852421-4.606024 139.306637-35.108139 38.690602-52.713386 85.620869-52.713386 140.739623 0 38.690602 4.606024 72.826357 13.715716 102.458445 9.109692 29.58091 20.778286 53.481057 34.954605 71.700441a180.658498 180.658498 0 0 0 53.634591 45.753172c21.545957 12.282731 42.477777 21.18771 62.641926 26.612583 20.215328 5.527229 42.989557 9.621472 68.32269 12.333909-17.758781 16.376974-28.659705 39.867697-32.651593 70.369811a129.941055 129.941055 0 0 1-29.990334 10.235609 184.087426 184.087426 0 0 1-37.974109 3.428929c-14.688099 0-29.171485-4.913092-43.654872-14.688099-14.432209-9.826185-26.766117-24.053681-37.001726-42.682489a109.162769 109.162769 0 0 0-32.293346-35.517563c-13.101579-9.109692-24.104859-14.585743-33.009839-16.376974l-13.306292-2.047122c-9.314404 0-15.762838 1.023561-19.345301 3.070683-3.582463 2.047122-4.606024 4.606024-3.326572 7.83024a37.769397 37.769397 0 0 0 5.987831 9.570295 49.182101 49.182101 0 0 0 8.700267 8.188487l4.606024 3.377751c9.826185 4.606024 19.447657 13.255114 29.017952 25.998447 9.570294 12.743333 16.581686 24.360749 20.982998 34.80107l6.653146 15.71166c5.783119 17.298179 15.558126 31.320963 29.376197 42.017174 13.766894 10.747389 28.659705 17.554069 44.627255 20.471218 15.96755 2.968327 31.423319 4.606024 46.316131 4.810736 14.841633 0.204712 27.22672-0.562958 37.001726-2.405368l15.302235-2.712436c0 17.298179 0.102356 37.564685 0.358247 60.799517l0.307068 36.848192c0 8.188487-2.86597 15.046345-8.700268 20.471218-5.731941 5.527229-14.636921 7.113748-26.612583 4.810736-103.072582-35.056961-187.158109-98.261846-252.205404-189.512299C32.549236 741.736195 0 638.919504 0 524.587752c0-95.191163 22.876586-182.910331 68.629758-263.31104a516.028224 516.028224 0 0 1 186.288082-190.894106A491.309228 491.309228 0 0 1 511.780446 0.012795a491.309228 491.309228 0 0 1 256.913784 70.369811 516.028224 516.028224 0 0 1 186.236905 190.894106C1000.684306 341.626242 1023.560892 429.447767 1023.560892 524.587752z"
                                    fill="#2254f4"
                                    p-id="5455"
                                ></path>
                            </svg>
                        </div>
                    </a>
                </div>
            </div>
        </GeHeader>
        <div class="main-container">
            <GeMain>
                <div class="main-container__top">
                    <div class="main-container__top__left">
                        <div style="max-width: 330px; margin-top: -120px">
                            <p class="main-container__top__left__title">统一、轻便、易用</p>
                            <p class="main-container__top__left__title">稿定编辑器UI组件库</p>
                            <p style="text-align: left; margin-top: 42px">
                                出发吧！从零组装新的编辑器！gd-eui就像搭积木一样搭建编辑器产品。
                            </p>
                            <div class="main-container__top__left__bts">
                                <Button style="width: 120px" type="primary" @click="goDocs">
                                    开始使用
                                </Button>
                                <Button style="margin-left: 14px" @click="goGithub">
                                    <div>
                                        <svg
                                            t="1644493627967"
                                            class="icon"
                                            viewBox="0 0 1024 1024"
                                            version="1.1"
                                            xmlns="http://www.w3.org/2000/svg"
                                            p-id="5454"
                                            width="20"
                                            height="20"
                                        >
                                            <path
                                                d="M1023.560892 524.587752c0 114.331752-32.549236 217.148443-97.647709 308.450075-65.047295 91.301632-149.132822 154.455339-252.205404 189.512299-11.975662 2.303012-20.778286 0.716493-26.305515-4.759558a27.584966 27.584966 0 0 1-8.342021-20.471218V853.150798c0-44.166653-11.566238-76.511177-34.647536-96.982394a446.272549 446.272549 0 0 0 68.32269-12.282731c20.16415-5.476051 41.044792-14.329852 62.590748-26.612583a187.311643 187.311643 0 0 0 53.992837-45.446104c14.432209-18.014672 26.203159-41.914819 35.312851-71.751618 9.109692-29.8368 13.664538-64.074912 13.664538-102.765514 0-55.118754-17.554069-102.049021-52.61103-140.739623 16.376974-41.454216 14.636921-87.872703-5.373695-139.357815-12.436265-4.094244-30.399759-1.535341-53.941659 7.523172a355.17563 355.17563 0 0 0-61.311297 30.041513l-25.333132 16.376974a462.137743 462.137743 0 0 0-127.945112-17.707604 462.137743 462.137743 0 0 0-127.945111 17.758782 589.571074 589.571074 0 0 0-28.301459-18.424096c-11.77095-7.31846-30.34858-16.069906-55.681713-26.305515-25.281954-10.235609-44.422543-13.306292-57.31941-9.212048-19.498835 51.433935-21.085354 97.852421-4.606024 139.306637-35.108139 38.690602-52.713386 85.620869-52.713386 140.739623 0 38.690602 4.606024 72.826357 13.715716 102.458445 9.109692 29.58091 20.778286 53.481057 34.954605 71.700441a180.658498 180.658498 0 0 0 53.634591 45.753172c21.545957 12.282731 42.477777 21.18771 62.641926 26.612583 20.215328 5.527229 42.989557 9.621472 68.32269 12.333909-17.758781 16.376974-28.659705 39.867697-32.651593 70.369811a129.941055 129.941055 0 0 1-29.990334 10.235609 184.087426 184.087426 0 0 1-37.974109 3.428929c-14.688099 0-29.171485-4.913092-43.654872-14.688099-14.432209-9.826185-26.766117-24.053681-37.001726-42.682489a109.162769 109.162769 0 0 0-32.293346-35.517563c-13.101579-9.109692-24.104859-14.585743-33.009839-16.376974l-13.306292-2.047122c-9.314404 0-15.762838 1.023561-19.345301 3.070683-3.582463 2.047122-4.606024 4.606024-3.326572 7.83024a37.769397 37.769397 0 0 0 5.987831 9.570295 49.182101 49.182101 0 0 0 8.700267 8.188487l4.606024 3.377751c9.826185 4.606024 19.447657 13.255114 29.017952 25.998447 9.570294 12.743333 16.581686 24.360749 20.982998 34.80107l6.653146 15.71166c5.783119 17.298179 15.558126 31.320963 29.376197 42.017174 13.766894 10.747389 28.659705 17.554069 44.627255 20.471218 15.96755 2.968327 31.423319 4.606024 46.316131 4.810736 14.841633 0.204712 27.22672-0.562958 37.001726-2.405368l15.302235-2.712436c0 17.298179 0.102356 37.564685 0.358247 60.799517l0.307068 36.848192c0 8.188487-2.86597 15.046345-8.700268 20.471218-5.731941 5.527229-14.636921 7.113748-26.612583 4.810736-103.072582-35.056961-187.158109-98.261846-252.205404-189.512299C32.549236 741.736195 0 638.919504 0 524.587752c0-95.191163 22.876586-182.910331 68.629758-263.31104a516.028224 516.028224 0 0 1 186.288082-190.894106A491.309228 491.309228 0 0 1 511.780446 0.012795a491.309228 491.309228 0 0 1 256.913784 70.369811 516.028224 516.028224 0 0 1 186.236905 190.894106C1000.684306 341.626242 1023.560892 429.447767 1023.560892 524.587752z"
                                                fill="#2254f4"
                                                p-id="5455"
                                            ></path>
                                        </svg>
                                        Github
                                    </div>
                                </Button>
                            </div>
                        </div>
                    </div>
                    <div class="main-container__top__right">
                        <juggle />
                    </div>
                </div>

                <div class="main-line"></div>
                <div class="main-container__top2">
                    <div class="main-container__top__left__title">欢迎共建</div>
                    <p>
                        我们将会做一件十分有意义的事，所有的编辑器开发将使用gd-eui取代，统一编辑器的UI组件，拥有详细的组件使用文档及炫酷的组件库首页。当我们再需要做一个新的编辑器产品的时候，gd-eui就像搭积木一样组装成形，它将不是一个简单的组件库，请把当作一个编辑器组件开发的标准规范，把它当作一个产品，或许我们可以把它做成一个PaaS产品。
                        在它支持组件库基础的功能外，希望它将继续支持接入figma、sketch等设计软件，不但我们的开发可以使用它，我们的设计师可以使用它，我们的产品可以使用它。
                        我们欢迎每一位为gd-eui贡献的同学，也感谢每一位支持gd-eui的同学，希望它能一个编辑器共识的组件库产品。
                    </p>
                </div>
                <div class="main-line"></div>
                <div class="main-container__top2">
                    <div class="main-container__top__left__title">更多功能，敬请期待</div>
                </div>

                <div class="main-container__footer">
                    <div>
                        <div class="main-container__footer__title">GD-EUI</div>
                    </div>
                    <div>
                        <a class="home-link-class" href="/pages/gaoding/editor/docs/gd-eui/start/1-start.html">组件库文档</a>
                        <a class="home-link-class" href="https://git.gaoding.com/gaoding/editor/tree/f_gd_eui_master" >github</a>
                    </div>
                </div>
                <!-- <a href="/pages/gaoding/editor/docs/gd-eui/start/1-start.html">Get started</a> -->
            </GeMain>
        </div>
        <!-- <GeFooter></GeFooter> -->
    </GeContainer>
</template>

<script lang="ts">
import Vue from 'vue';
import { Button } from '@gaoding/gd-antd';
import '@gaoding/gd-antd/es/style/index';
import { GeContainer, GeHeader, GeMain, GeFooter } from '../../../src';
import '../../../es/components/container/container/style';
import '../../../es/components/container/header/style';
import '../../../es/components/container/main/style';
import '../../../es/components/container/footer/style';
import Juggle from './Juggle.vue';

export default {
    components: {
        GeContainer,
        GeHeader,
        GeMain,
        GeFooter,
        Button,
        Juggle,
    },
    methods: {
        goDocs() {
            location.href = '/pages/gaoding/editor/docs/gd-eui/start/1-start.html';
        },
        goGithub() {
            location.href = 'https://git.gaoding.com/gaoding/editor/tree/f_gd_eui_master';
        },
    },
};
</script>
<style lang="less">
@import url('../../../es/style/themes/default.less');
.homepage {
    &__header__wrap {
        position: fixed;
        z-index: 999;
        width: 100%;
        top: 0;
        height: 56px;
        background: rgba(255, 255, 255, 0.72);
        box-shadow: inset 0px -1px 1px #e7ebf0;
    }
    &__header {
        display: flex;
        height: 56px;
        align-items: center;
        justify-content: space-between;
        &__right {
            display: flex;
            height: 56px;
            align-items: center;
            &__icon {
                color: @primary-color !important;
            }
            &__a {
                height: 36px;
                display: inherit;
                margin-right: 12px;
            }
            &__bt {
                display: inline-flex;
                overflow: visible;
                justify-content: center;
                flex: 0 0 auto;
                font-size: 20px;
                padding: 8px;
                height: 36px;
                width: 36px;
                border: 1px solid #e0e3e7;
                border-radius: 10px;
                color: @primary-color;
                position: relative;
            }
        }
    }
}
.homepage__container {
    .ge-header {
        padding: 0px 12px;
    }
}
.header {
    &__title {
        font-weight: bold;
        padding-left: 4px;
        font-size: 14px;
    }
}
.main-container {
    margin-top: 56px;
    .ge-main {
        background: #fff;
        padding: 0px;
    }
    &__top {
        display: flex;
        &__left {
            // width: 40%;
            // max-width: 490px;
            display: flex;
            flex-direction: column;
            justify-content: center;
            align-items: center;
            flex-grow: 1;
            min-width: 330px;
            height: 800px;
            background: #fff;
            &__title {
                font-weight: 500;
                font-size: 32px;
                line-height: 36px;
                text-align: left;
                margin-bottom: 16px;
            }
            &__bts {
                display: flex;
                margin-top: 88px;
            }
        }
        &__right {
            width: 820px;
            height: 700px;
            overflow-y: scroll;
            overflow-x: hidden;
            background: rgb(243, 246, 249);
            border-bottom-left-radius: 24px;
            border: solid 1px #f3f3f3;
        }
    }
    &__top2 {
        padding: 64px 128px;
    }
    &__footer {
        &__title {
            font-size: 20px;
            font-weight: 500;
        }
        display: flex;
        justify-content: space-between;
        height: 200px;
        margin-top: 50px;
        padding: 64px 128px;
        background: rgb(243, 246, 249);
    }
}
.main-line {
    border-bottom: 1px solid #e7ebf0;
}
.home-link-class {
    margin-right: 120px;
    margin-top: 10px;
    color: #3e5060;
    line-height: 1.5;
    letter-spacing: 0;
    font-family: 'IBM Plex Sans', -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto,
        'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji',
        'Segoe UI Symbol';
    font-weight: 400;
}
#app {
    padding: 0px;
}

thead {
    background: aliceblue;
}
</style>
